---
kind: method
id: M:Autodesk.Revit.DB.ModelCurveArrArray.Append(Autodesk.Revit.DB.ModelCurveArray)
source: html/057cdfaf-da52-f991-7555-fac72acca965.htm
---
# Autodesk.Revit.DB.ModelCurveArrArray.Append Method

## Syntax (C#)
```csharp
public virtual void Append(
	ModelCurveArray item
)
```

## Parameters
- **item** (`Autodesk.Revit.DB.ModelCurveArray`)